"""
Настройки терминального монитора Raspberry Pi.
"""
#----------------------
# Температура CPU (°C)
#----------------------
# Температура ВЫСОКАЯ (выводится жёлтым)
CPU_WARN = 70
# Температура КРИТИЧНАЯ (выводится красным)
CPU_CRIT = 80

#----------------------
# Температура NVMe (°C)
#----------------------
# Температура ВЫСОКАЯ (выводится жёлтым)
NVME_WARN = 60
# Температура КРИТИЧНАЯ (выводится красным)
NVME_CRIT = 70

#----------------------
# Прочие параметры
#----------------------
# Количество символов в графической шкале температуры.
BAR_WIDTH = 30
# Интервал обновления показателей (в секундах).
DEFAULT_INTERVAL = 1.0